#Область ПрограммныйИнтерфейс

Функция ПолучитьПолныйСписокПолейОписанияТоррента() Экспорт
	
	МассивПолей = Новый Массив;
	
	МассивПолей.Добавить("activityDate");  	// The last time we uploaded or downloaded piece data on this torrent
	МассивПолей.Добавить("addedDate");		// When the torrent was first added.
	МассивПолей.Добавить("availability");
	МассивПолей.Добавить("bandwidthPriority");	// // the file's priority
	МассивПолей.Добавить("comment");
	МассивПолей.Добавить("corruptEver");
	МассивПолей.Добавить("creator");
	МассивПолей.Добавить("dateCreated");
	МассивПолей.Добавить("desiredAvailable");
	МассивПолей.Добавить("doneDate");
	МассивПолей.Добавить("downloadDir");
	МассивПолей.Добавить("downloadedEver");
	МассивПолей.Добавить("downloadLimit");
	МассивПолей.Добавить("downloadLimited");
	МассивПолей.Добавить("editDate");
	МассивПолей.Добавить("error");
	МассивПолей.Добавить("errorString");
	МассивПолей.Добавить("eta");
	МассивПолей.Добавить("etaIdle");
	МассивПолей.Добавить("file-count");
	МассивПолей.Добавить("files");
	МассивПолей.Добавить("fileStats");
	МассивПолей.Добавить("group");
	МассивПолей.Добавить("hashString");
	МассивПолей.Добавить("haveUnchecked");
	МассивПолей.Добавить("haveValid");
	МассивПолей.Добавить("honorsSessionLimits");
	МассивПолей.Добавить("id");
	МассивПолей.Добавить("isFinished");
	МассивПолей.Добавить("isPrivate");
	МассивПолей.Добавить("isStalled");
	МассивПолей.Добавить("labels");
	МассивПолей.Добавить("leftUntilDone");
	МассивПолей.Добавить("magnetLink");
	МассивПолей.Добавить("manualAnnounceTime");
	МассивПолей.Добавить("maxConnectedPeers");
	МассивПолей.Добавить("metadataPercentComplete");
	МассивПолей.Добавить("name");
	МассивПолей.Добавить("peer-limit");
	МассивПолей.Добавить("peers");
	МассивПолей.Добавить("peersConnected");
	МассивПолей.Добавить("peersFrom");
	МассивПолей.Добавить("peersGettingFromUs");
	МассивПолей.Добавить("peersSendingToUs");
	МассивПолей.Добавить("percentComplete");
	МассивПолей.Добавить("percentDone");
	МассивПолей.Добавить("pieces");
	МассивПолей.Добавить("pieceCount");
	МассивПолей.Добавить("pieceSize");
	МассивПолей.Добавить("priorities");
	МассивПолей.Добавить("primary-mime-type");
	МассивПолей.Добавить("queuePosition");
	МассивПолей.Добавить("rateDownload");
	МассивПолей.Добавить("rateUpload");
	МассивПолей.Добавить("recheckProgress");
	МассивПолей.Добавить("secondsDownloading");
	МассивПолей.Добавить("secondsSeeding");
	МассивПолей.Добавить("seedIdleLimit");
	МассивПолей.Добавить("seedIdleMode");
	МассивПолей.Добавить("seedRatioLimit");
	МассивПолей.Добавить("seedRatioMode");
	МассивПолей.Добавить("sizeWhenDone");
	МассивПолей.Добавить("startDate");
	МассивПолей.Добавить("status");
	МассивПолей.Добавить("trackers");
	МассивПолей.Добавить("trackerList");
	МассивПолей.Добавить("trackerStats");
	МассивПолей.Добавить("totalSize");
	МассивПолей.Добавить("torrentFile");
	МассивПолей.Добавить("uploadedEver");
	МассивПолей.Добавить("uploadLimit");
	МассивПолей.Добавить("uploadLimited");
	МассивПолей.Добавить("uploadRatio");
	МассивПолей.Добавить("wanted");
	МассивПолей.Добавить("webseeds");
	МассивПолей.Добавить("webseedsSendingToUs");
	
	Возврат МассивПолей;
	
КонецФункции

Функция ПолучитьСписокПолейДляТабличнойЧасти() Экспорт
	
	МассивПолей = Новый Массив();
	
	МассивПолей.Добавить("name");
	МассивПолей.Добавить("id");	
	
	Возврат МассивПолей;
	
КонецФункции

#КонецОбласти