#Область ПрограммныйИнтерфейс

Функция TimestampВДату(пДатаТС) Экспорт
 	Попытка
 		Возврат Дата("19700101") + ?(ТипЗнч(пДатаТС) = Тип("Строка"), Число(пДатаТС), пДатаТС);
 	Исключение
 		Возврат Дата(1, 1, 1);
 	КонецПопытки;
КонецФункции

Функция БайтыВЧитаемойФорме(Количество) Экспорт
	
	Если Количество = 0 Тогда
		Возврат НСтр("ru = '0 Б.'");
	ИначеЕсли Количество < 1000 Тогда
		Шаблон = НСтр("ru = '%1 Б.'");
		Возврат СтрШаблон(Шаблон, Количество);
	ИначеЕсли Количество < 999999 Тогда
		Шаблон = НСтр("ru = '%1 КБ.'");
		Возврат СтрШаблон(Шаблон, Окр(Количество / 1024, 3));
	ИначеЕсли Количество < 999999999 Тогда
		Шаблон = НСтр("ru = '%1 МБ'");
		Возврат СтрШаблон(Шаблон, Окр(Количество / 1024 / 1024, 3));
	ИначеЕсли Количество < 999999999999 Тогда
		Шаблон = НСтр("ru = '%1 ГБ'");
		Возврат СтрШаблон(Шаблон, Окр(Количество / 1024 / 1024 / 1024, 3));
	Иначе
		Шаблон = НСтр("ru = '%1 ПБ'");
		Возврат СтрШаблон(Шаблон, Окр(Количество / 1024 / 1024 / 1024 / 1024, 3));
	КонецЕсли;
	
КонецФункции

#КонецОбласти