#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступностьПолейАвторизации();
КонецПроцедуры

#КонецОбласти

#область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТребуетсяАвторизацияПриИзменении(Элемент)
	УстановитьДоступностьПолейАвторизации();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьДоступностьПолейАвторизации()

	Если Объект.ТребуетсяАвторизация Тогда
		Элементы.Логин.ТолькоПросмотр = Ложь;
		Элементы.Пароль.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.Логин.ТолькоПросмотр = Истина;
		Элементы.Пароль.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти